[
 {
   "sign": "leo",
   "text": "Boost your blue mood with some nice conversation today.Seek out a funny friend"
 },
 {
   "sign": "leo",
   "text": "Be faithfull in yourself and in your heart -- it will tell you what you need to do"
 },
 {
   "sign": "leo",
   "text": "Meeting a new person today? An unexpected snag will help you two bond more closely"
 },
 {
   "sign": "leo",
   "text": "It s one of those days when you need to perform for people, maybe on a date. You re not feeling totally confident, but the show must go on and you do just fine"
 },
 {
   "sign": "leo",
   "text": "You re on fire today! Whatever you choose to apply yourself to is sure to go well and while others may not fully understand what s going on, you know you can explain it to them later"
 },
 {
   "sign": "leo",
   "text": "You feel like you re going through a lot right now, but you also feel certain that it s all good in the long run. It s one of those days when you can transform yourself without much trouble"
 },
 {
   "sign": "leo",
   "text": "You re in the middle of some intricate financial dealings and need to make sure that you ve got all the information you need. You may have to plow ahead blinda for a while, but not for long"
 },
 {
   "sign": "leo",
   "text": "Prove yourself to a friend or relative today it s easy for you! Try to just keep them on their toes a little, but make sure you swoop in the save the day just then they need you the most"
 },
 {
   "sign": "leo",
   "text": "You re commited to one person but it might not be a romantic thing! Your ability to build strong relantionships extends to all areas of life, so expect this to last quite a long time for you both"
 },
 {
   "sign": "leo",
   "text": "Can you blow off bills and paperwork for another day or two ? If so, you certanily should your ability to tackle small details is rather lacking just now and you d rather deal with something bigger"
 },
 {
   "sign": "",
   "text": "Sometimes it feels like patience isn t a virtue as much as a method of torture! If you want to retain any sense of balance in your life, you re going to have to find a way to take your internal clock and slow it down. A great way to slow your roll would be to laugh a lot, so talk to people who always have a funny take on things. Their quips and witty comments will help take your mind off your urge to rush around and help you stay hopeful for the future."
 },
 {
   "sign": "",
   "text": "Give it all you ve got and then some. You may not see results right away, but in putting forth a full effort, you ll learn to appreciate the process, and that s truly what s most important. Life may never be perfect, but it can be a lot of fun if you let yourself relish what s right in front of you. Enjoying the journey is what gives your day-to-day existence meaning. After that, the destination is almost beside the point."
 },
 {
   "sign": "",
   "text": "Today you could get a stronger sense of what your role in a relationship is, and you might not like what you discover. You thought there was permanence to this partnership, but now you re not so sure. Before you throw in the towel and assume it s all over, have a conversation with the other person. Tell them what you think about the balance of power between the two of you and ask them if what you fear is true. Chances are good you ve misunderstood something."
 },
 {
   "sign": "",
   "text": "You need to chill out a bit, or else someone else is going to take things the wrong way -- and nobody wants that! It s one of those days when you should make sure you re letting folks be."
 },
 {
   "sign": "",
   "text": "Something big blows your mind early today and leaves you feeling a little shaky. It ends up being a good thing in the long run, so don t worry too much about what it really means in the present."
 },
 {
   "sign": "",
   "text": "It feels as if nothing is going right for you today, and you might end up trying to ditch a friend or get out of some responsibility. Try to stick with the program for now -- things are just about to get better!"
 },
 {
   "sign": "",
   "text": "Put your drive for success on hold. It s time to slow down and enjoy life. The start of a new season brings all kinds of change, so force yourself to enjoy some leisure while you can."
 },
 {
   "sign": "",
   "text": "You re the type who loves meeting new people and exploring new cultures. So the changes in the financial landscape are nothing short of exciting for you. You feel energized to take action."
 },
 {
   "sign": "",
   "text": "For someone with as much drive as you have, sleepy days can be harder than regular days. The rest will do you good if you force yourself to try it. Tell yourself, you can do this."
 },
 {
   "sign": "",
   "text": "Put your drive for success on hold. It s time to slow down and enjoy life. The start of a new season brings all kinds of change, so force yourself to enjoy some leisure while you can."
 },
 {
   "sign": "",
   "text": "You re the type who loves meeting new people and exploring new cultures. So the changes in the financial landscape are nothing short of exciting for you. You feel energized to take action."
 },
 {
   "sign": "",
   "text": "For someone with as much drive as you have, sleepy days can be harder than regular days. The rest will do you good if you force yourself to try it. Tell yourself, you can do this."
 },
 {
   "sign": "",
   "text": "Hope springs eternal, and the coming days could bring some new opportunities to meet someone great. Keep it light and friendly until you know for sure what each of you is looking for."
 },
 {
   "sign": "",
   "text": "If you re getting tired of waiting for someone to ask you out, you can get things rolling. When the time is right, go for it. The other person is sure to be glad you took the lead."
 },
 {
   "sign": "",
   "text": "The long hours you ve been working are starting to pay off, and you re recognized as the superstar you already know you are! Celebrate success with friends and see who takes notice."
 },
 {
   "sign": "",
   "text": "Rise to the challenge and you ll soon be hearing applause. You ve got the right stuff whether you realize it or not. If you need some backup, ask your partner (it s easy to say, but hard to remember to do)."
 },
 {
   "sign": "",
   "text": "When it comes to feelings and how to express them, you want to break all the rules. That s understandable, but sit on it for a little while before you speak with your partner. This could just be a passing fancy."
 },
 {
   "sign": "",
   "text": "A frayed hem or loose shoelace could wreak havoc when you least expect it today. All the more reason to take an extra five minutes and make sure that your zippers are lined up and everything is in place before you leave."
 },
 {
   "sign": "",
   "text": "People are watching who can help you advance, but they need to know that you re hungry for more. Your ambitions are out in force right now, and you re feeling just fine about that."
 },
 {
   "sign": "",
   "text": "Morale, finances, and networking are all prime possibilities for today. You are in a very good position to get started on a new system that will improve the basic health of your organization."
 },
 {
   "sign": "",
   "text": "It might not be the best time to ask for a raise, but it s definitely a good time to start making the case that you re worth more. Compensation is on your mind, and rightly so."
 },
 {
   "sign": "",
   "text": "A new salon can be an intimidating experience. That s to be expected -- all those hipper-than-thou types can be overwhelming. Give it a moment before you decide it s not your scene. First impressions can be wrong."
 },
 {
   "sign": "",
   "text": "Utilize all your resources. When you weed out the unworn and the unused items from your closet, you re left with clothes you actually like and are flattering on you. Voila! You have a wardrobe that works wonderfully."
 },
 {
   "sign": "",
   "text": "If you re tempted to cut in line or otherwise cheat a bit to get ahead at the beginning of the week, consider your traveler s karma. Why not spend those extra few minutes talking to someone interesting or offering somebody a hand? Things will go more smoothly for you, and you ll have more fun later. Like on Wednesday and Thursday. What goes around, comes around, and you could get surprisingly, touchingly generous treatment now. And you can move right along at your brisk pace! On Friday and Saturday, however, it s hard to get going. Never fear. Sunday kicks off a couple great travel days."
 },
 {
   "sign": "",
   "text": "Your amped-up independence and energy make you a natural traveler at the beginning of the week, and if you encounter any difficulties, just let your (also amped-up) charm kick in. A smile gets you where you want to go (and maybe even further). You ll want to be adventurous on Thursday and Friday, but various circumstances may slow you down. Getting aggro won t speed things back up. Try to relax and calmly find a new route. The energy this weekend is perfect for being on the road and for being you. Drink in some culture and meet some foreign types."
 },
 {
   "sign": "",
   "text": "You re the first one up and at  em on Monday, ardently exploring your destination. Energy that s a bit mellower comes into the picture on Tuesday or Wednesday. If you re frustrated with the pace of a group or a companion, excuse yourself for something brisker. Fire off an email travelogue update toward the end of the week; communication s favored, and those back home love to live vicariously through your adventures. While you re at it, find a good online deal for lodgings or some insider tips about where to eat, etc. Watch for an unusual emotional response to your journey on Sunday."
 },
 {
   "sign": "",
   "text": "If things have been a bit stagnant lately, don t worry. They re about to change. You could have so many people begging for attention that you have your pick of partners! Expect to be quite busy."
 },
 {
   "sign": "",
   "text": "So many choices! With so many profiles to read, how can you pick which ones to respond to? Remember that quality is far more important than quantity. Narrow down your choices to those you have the most in common with."
 },
 {
   "sign": "",
   "text": "Are you prepared for romance? Ready or not, it s coming for you! You may have caught someone s eye, and they could soon be making a move. Whether it s someone you already know or an intriguing newcomer, you don t want to miss a minute of it!"
 },
 {
   "sign": "",
   "text": "Focus on your friends and roommates today -- or anyone who might turn into a love connection. You re unusually intense, but your social energy is right on and ready to make stuff happen."
 },
 {
   "sign": "",
   "text": "You can t help but try to keep your people by your side -- even if they d rather roam. It s one of those days when your mood just doesn t match up with anyone else s, but it won t last long."
 },
 {
   "sign": "",
   "text": "It may be true that life isn t a popularity contest -- but that doesn t mean you don t care! Today is a really good day to check your ranking and add more friends by any means necessary."
 },
 {
   "sign": "",
   "text": "Ah, you get the perfect day. The stars line up for you to luxuriate in the time you spend with yourself, even if you have to spend some money for it. You can turn any environment into a day spa."
 },
 {
   "sign": "",
   "text": "It s hard to focus when your subconscious is whispering the words  day off  over and over again. It could be time to hang up your gear early and give up on making a buck. Consider it a well deserved rest."
 },
 {
   "sign": "",
   "text": "It pays to get away. You need some kind of traveling experience. If you don t have money to do so, have this experience even if it s only watching foreign movies."
 },
 {
   "sign": "",
   "text": "So many choices! With so many profiles to read, how can you pick which ones to respond to? Remember that quality is far more important than quantity. Narrow down your choices to those you have the most in common with."
 },
 {
   "sign": "",
   "text": "Are you prepared for romance? Ready or not, it s coming for you! You may have caught someone s eye, and they could soon be making a move. Whether it s someone you already know or an intriguing newcomer, you don t want to miss a minute of it!"
 },
 {
   "sign": "",
   "text": "Why save romance for the days when the greeting card companies say you should be demonstrative? Get a little amorous today (and every day). Spontaneous displays of affection are most welcome by you and your partner."
 },
 {
   "sign": "",
   "text": "Say it ain t so! But alas, it s true. You and your partner have been putting off dealing with a certain task for too long. Whether it s a \"state of the union\" kind of talk or a household chore, you need to face it."
 },
 {
   "sign": "",
   "text": "Being impulsive usually isn t your thing, but every now and then you like to mix it up. You enjoy keeping your partner on their toes! A deliberately outrageous comment, an impromptu serenade, it s all good."
 },
 {
   "sign": "",
   "text": "There s no need to plan out your day. It will be full of surprises some quite pleasant. Though the day s energy is pretty frantic, you ll need to stay calm and take care of things as they arise."
 },
 {
   "sign": "",
   "text": "You ll make a good impression because you are feeling especially vigorous and energetic. You might be able to pull off an extra shift or some other equally impressive stunt if the situation calls for it."
 },
 {
   "sign": "",
   "text": "Your loyalties might be tested, especially if you work in a creative industry. Either way, you ll have the luxury of taking the route that works best for you."
 },
 {
   "sign": "",
   "text": "Feeling pretty is more than half the battle to actually looking pretty. So before you start criticizing your physical appearance, analyze your attitude instead. Some self-love and better posture are a good start."
 },
 {
   "sign": "",
   "text": "Tired of your usual blush? Bronzer will perk up your complexion and expand your color palette beyond the usual roses, pinks, berries and corals. Don t forget to hit all the spots the sun would when you apply."
 },
 {
   "sign": "",
   "text": "Travel light if you re going somewhere. How can you have fun if you re worried about what hair product to use? Instead, opt for an easy wash-and-go style that gives you maximum style in a minimum of time."
 },
 {
   "sign": "",
   "text": "Travel plans are firm on Monday and Tuesday, and your energy and endurance let you see and do a ton and enjoy every minute of it. Your inner calm means you can entertain different points of view now too. This may not be the case on Wednesday and Thursday, when you re wishing people would behave predictably and things would be like they are at home. Comfort yourself with a familiar book or a nice nap. By the weekend, you re in a mode of accepting and even embracing your destination. The differences you find now are interesting, inspiring, and photo-worthy. Record your experiences."
 },
 {
   "sign": "",
   "text": "The beginning of the week is tailor-made for busting out of your routine, and there s no better way to do that than through travel. Great interpersonal interactions add to the fun. Your possessive side comes out on Thursday or Friday. Maybe there s something you feel you absolutely have to have, or maybe you re getting attached to your destination. Remember that the real value here is in expanding your point of view and in the memories you ll create. Charming people from other cultures is easy as pie for you this weekend, making for good times for you and those lucky enough to meet you."
 },
 {
   "sign": "",
   "text": "A trinket or a treasure? Something s enticing on Monday, but engage your practical side and shop around. A flea market offers one-of-a-kind souvenirs at bargain prices. You re full of energy and verve from Tuesday through Thursday. Indulge your love of nature with a hike or a garden tour, and check out some local art or music as well. Build time into your itinerary for last-minute surprises on Friday and Saturday: If you plan as much as possible for the unexpected, then you won t be thrown for such a loop. Communication s good now, and more so on Sunday -- try making a new friend."
 },
 {
   "sign": "",
   "text": "It s a good thing to share your ideas and goals with the people in your life who can encourage you, but you need to do more than that right now. After all, is talking about what you want going to get it? No! The only way you can get what you want is by working for it. Right now, while your desire is still great, start focusing your energy on reaching your goals. You can make things happen in your life. Huge opportunities are right in front of you."
 },
 {
   "sign": "",
   "text": "Playing the field is all well and good. Heck, part of the joy of life is keeping your options open. Even so, you should make an effort to act honorably at all times. So if you have a ton of choices, please remember that other folks are involved too. You don t have to show all your cards by any means, but if it seems like someone s getting more invested in you than you are in them, it might be time to clear the air."
 },
 {
   "sign": "",
   "text": "What your friends do now is anyone s guess. They are very unpredictable right now, which means you should have no expectations or even any preferences when it comes to them. If they ask you for advice, you should, give it to them, but don t expect them to follow it to the letter, or at all! This day will probably test your flexibility and patience, but it will still be quite enjoyable and you re sure to have a fun time. Your favorite people always make life interesting, don t they?"
 },
 {
   "sign": "",
   "text": "Life is sweet, but you re bugged by some oddity that hasn t ever made sense to you. Now is the time to investigate -- not that you ll necessarily dig up anything new. The search is still worth it!"
 },
 {
   "sign": "",
   "text": "Look at the situation one more time with fresh eyes -- things are a little different than you think. Once you ve taken in the new info, you should be able to crack the case and make sense of it all."
 },
 {
   "sign": "",
   "text": "It s a quieter day for you -- one you need in a big way! Just chill out and let other people freak out and get crazy. You can prop up your feet and just stare into space until they re done."
 },
 {
   "sign": "",
   "text": "For once there are no confusing undercurrents. You and your partner enjoy each other s company, pure and simple. Even money can t come between you today. Enjoy."
 },
 {
   "sign": "",
   "text": "It s hard when the outcome is out of your hands. That s what happens when your personal finances are tied so directly to the world economy. If it s any consolation to you, everyone is in the same boat."
 },
 {
   "sign": "",
   "text": "When it comes to making money, there s just no holding you back. But today you get to do nothing but let others take the reigns. Just where they take the day awaits to be seen."
 },
 {
   "sign": "",
   "text": "Someone close has romantic advice to share. It s totally up to you whether you want to act on it, but at least hear them out. Other people s romantic experience can always be helpful even if you re just learning what not to do!"
 },
 {
   "sign": "",
   "text": "That late-night talk with your new crush might very well go on for hours. That s cool. If you feel a spark, you need to go for it! Keep things lively, have fun, and leave tomorrow s problems for tomorrow."
 },
 {
   "sign": "",
   "text": "Now is the time to catch up with someone you ve lost touch with, maybe an ex? You should have a great time filling each other in, and you might find there s still a spark ready to be rekindled."
 },
 {
   "sign": "",
   "text": "How can you two have a life if you spend your time worrying about what might happen in this relationship? Acknowledging your worries and then resolving to move forward, that s the definition of courage."
 },
 {
   "sign": "",
   "text": "Someone s smooth ways may be clouding your perspective. Are they trying to sell you a literal or metaphorical bill of goods? Don t let their persuasive (but flawed) theories influence you."
 },
 {
   "sign": "",
   "text": "Is your partner actually challenging your expertise? What nerve! Take a step back before you blast them. Could it be that they have a point? Why be stuck in your ways if a better method appears?"
 },
 {
   "sign": "",
   "text": "Make sure you give everyone equal attention so you can get on board when things get going. People you don t know well yet are going to play important roles in the upcoming events."
 },
 {
   "sign": "",
   "text": "Gaps in your knowledge should be seen as opportunities rather than weaknesses. It s imperative that you be forthright about what you know and don t know."
 },
 {
   "sign": "",
   "text": "Some of your worries are groundless, but some are quite important. You might be tense right now, but things will ease up in a little while. You should be able to make the call in a day or two."
 },
 {
   "sign": "",
   "text": "Heat makes a deep conditioning treatment even more effective. Use a heat cap, a blow dryer and a shower cap or put your locks under an old baseball cap as you go for a walk or a light jog around the block."
 },
 {
   "sign": "",
   "text": "It s not just black that makes for a good wardrobe basic. Navy blue, rich shades of brown like espresso or chestnut: these all have the same advantages of black and can be combined with other colors in just as many ways."
 },
 {
   "sign": "",
   "text": "Sure, you ve colored your hair at home a million times, but it never hurts to read the directions on the box. What if something s changed or the time requirements are shorter? A little caution can prevent beauty disasters."
 },
 {
   "sign": "",
   "text": "If you re traveling with a companion, sit down at the beginning of the week and discuss your ideas about what you each have to see. Adjust your plans accordingly, and schedule some separate adventures. All things foreign are favored on Wednesday and Thursday. Your innate adaptability means you re fitting in like a native and connecting with all kinds of people. And, of course, you re changing your mind several times a day. Things aren t clicking quite as well this weekend. Be extra clear when communicating, double-check your itinerary, and don t overload on activities."
 },
 {
   "sign": "",
   "text": "You re getting attention everywhere you go at the beginning of the week, and traveling feels a little bit like being a rock star. One particular fan could even be a romantic possibility, if that s what you re in the mood for. Slow your pace on Thursday and Friday. Even rock stars need rest on the road, and your health is more important than seeing and doing absolutely everything. Some new ideas about your life in the long term can emerge now as well. Hold back on voicing your opinions this weekend. If you listen instead, there s much to learn from your destination and its people."
 },
 {
   "sign": "",
   "text": "If you re a bit of a chatterbox on Monday, that s all the better for getting to know both your destination and its people. Focus in on Tuesday and Wednesday: Arm yourself with information, and get into the culture and history of the place. Your smarts demand this kind of in-depth travel. Plan tons of activity for Thursday through Saturday; you re full of lively energy, sparking conversation and fun wherever you go. Don t flaunt an expensive camera or phone on Sunday, and keep your money and credit cards in a secure inner pocket or money belt. Better safe than sorry!"
 },
 {
   "sign": "",
   "text": "Your friends and family have been a valuable source of support and inspiration over the years, and it s time you thanked them all for their devotion. You might assume they know how you feel, but they d appreciate hearing it. If you can t see them in person, send handwritten cards or letters. Bake some cookies or other treats you can take to them or send them. Create a funny, multimedia video that tells them how you feel. Whatever you do, they ll know it s heartfelt and love it!"
 },
 {
   "sign": "",
   "text": "Feeling just a touch on the crabby side lately? It s tempting to want to use those claws of yours to pinch any inquiring noses that try to poke their way into your business, but hold off on that impulse. People care about you, and they want to know how you re doing. If you really need some serious downtime, inform them politely yet firmly that you know what you re doing, and you ll come out of your shell when you re good and ready."
 },
 {
   "sign": "",
   "text": "Help yourself today by helping others. Not only will the gratitude you receive lift your spirits, but it will also inspire you to do bigger and even better things for the world at large. Now is the right time to move forward with big plans. People who have power will be receptive to your ideas, and they ll be willing to give you the resources and encouragement you need. Consider a long-term volunteer opportunity: It might finally be time to take that step."
 },
 {
   "sign": "",
   "text": "Relationship issues are a drag today, and you should avoid rushing through anything. A new love interest might want you to promise them something -- but think it through all the way first!"
 },
 {
   "sign": "",
   "text": "You re breaking a sweat over something that really doesn t deserve your stress -- so try to relax! It s intense for sure, but you can deal with it, and you might find a way to turn it into something positive."
 },
 {
   "sign": "",
   "text": "Someone who s a little sketchy is trying to get you to go out with them or help them out with something you re not so sure about. It s a good time to practice saying  no  and then running!"
 },
 {
   "sign": "",
   "text": "You don t have to go to extremes to have fun. In fact, what you need is something low key. Money is not the issue, it s the energy level that matters. Keep your calm."
 },
 {
   "sign": "",
   "text": "You re turning your attention from your financial problems to your personal life problems. But why not go from your optimism concerning money to the joy of family and friends? Your life is what you make of it."
 },
 {
   "sign": "",
   "text": "Others may misinterpret in business, but among friends and family, you re being read like a book. Enjoy having your thoughts, emotions and motivations be crystal clear for a change."
 },
 {
   "sign": "",
   "text": "Anyone who wants to make casual conversation with you had better get ready. They re in the company of a master charmer! Your ability to turn little details into fascinating stories makes you the life of the party. Which lucky person will you turn your attention to next?"
 },
 {
   "sign": "",
   "text": "When you meet someone hot, you might get nervous and spit out the first phrase that comes to mind. Today, just stay calm and take a moment to compose your thoughts. Then let your charming self shine!"
 },
 {
   "sign": "",
   "text": "Someone close is going through a hard time. Your ability to empathize makes all the difference, so offer company and a willing ear. Your friendship is appreciated, and they are sure to return the favor someday."
 },
 {
   "sign": "",
   "text": "This relationship gets even more interesting when you let your instincts have free rein. Following your gut yields rich results. Start with dessert instead of salad. Play Scrabble with naughty words."
 },
 {
   "sign": "",
   "text": "Remember that rule about counting to ten before you speak? It helps to wait ten minutes before firing off any e-mails or texts too. Emotions run high (and deep) right now, so it helps to give yourself breathing room."
 },
 {
   "sign": "",
   "text": "Blurting out the first thing to cross your mind has interesting (and possibly steamy) results. Your partner loves it when you feel comfortable enough to be this uninhibited. You kind of like it yourself too."
 },
 {
   "sign": "",
   "text": "Don t start checking the job listings quite yet. Things should pick up again pretty quickly. You and your boss just aren t going to get along all that well right now, so resign yourself to subordination for the time being."
 },
 {
   "sign": "",
   "text": "Don t be shy about self-promotion right now. Everyone has to do it. You ll have at least a few hot ideas over the next few days that will kick things up a notch regarding your future with the organization."
 },
 {
   "sign": "",
   "text": "It s a good time to delegate and assign responsibilities. People are definitely willing to hear you out. You should be checking in with all the different projects you ve left alone for a while."
 },
 {
   "sign": "",
   "text": "Feeling shy about trying out an exercise or dance class that s totally new to you? No problem. Just make sure you stand where you get a good view of the instructor. There s no shame in deciding it s not for you, either."
 },
 {
   "sign": "",
   "text": "Your mother s been using the same cleanser, moisturizer and sunscreen for decades and her skin looks amazing. There s a lot to be said for finding a routine that works for you and sticking with it."
 },
 {
   "sign": "",
   "text": "Is your skin feeling tender or otherwise acting up? Maybe it s time to scale back on the skin products, especially any exfoliating products you re using. A good soap, sunblock and moisturizer will do the trick for now."
 },
 {
   "sign": "",
   "text": "You may not be up for conquering (or even exploring) the world on Monday and Tuesday. Traveling is all about your comfort level. Don t feel guilty about reading at the hotel or taking a nap break. Your changeable nature can serve you well on Wednesday and Thursday, when different people and situations require adjustments in approach. Feel things out and act accordingly. The weekend brings great energy overall. Your trip expands your point of view and even adds to your personal philosophy. One caveat: details (like flight times, for example) could elude you now."
 },
 {
   "sign": "",
   "text": "The beginning of the week could bring some difficulties with your lodgings or a travel partner. Be super explicit about your needs and expectations in either case. With a little patience, a happy resolution can be reached. Making a decision could be tough on Thursday or Friday. Err on the side of caution. Business travelers should avoid signing contracts or legal documents now. The weekend s the right time to truly relax and enjoy your trip. Treat yourself to some local cuisine done right, whether on the fancy side or down-home. And be sure to check out some art or music too."
 },
 {
   "sign": "",
   "text": "Take a deep breath rather than saying the first thing that pops to mind on Monday you don t want to antagonize those who can make your trip smoother. Change your mind with impunity on Tuesday or Wednesday. Nothing s set in stone here, so why not abandon the itinerary for something more unusual? The travel experience could get a little overwhelming toward the end of the week. Scale back the big plans; there s plenty to explore nearby, and you ll avoid sensory overload. Then, by Sunday, your energy s back up, and you can pretty much do and see it all."
 },
 {
   "sign": "",
   "text": "Housekeeping is good for you right now, so get to work closing out old projects and clearing up space for the next new wave of business to come in."
 },
 {
   "sign": "",
   "text": "A customer or distant work connection could surprise you with an opinion you hadn t considered before. You might find that it s perfectly in tune with your worldview once you absorb it."
 },
 {
   "sign": "",
   "text": "Use that intuition of yours to find the battlefield the fight s raging. You have to deal with the fog of war in a big way over the next few days. There s no way you can sit things out until more information comes in."
 },
 {
   "sign": "",
   "text": "Someone disses you without meaning to, and it s up to you whether you want to let it go and just brush it off, or step up to them and tell them they made a mistake. Either way, you ll be fine soon."
 },
 {
   "sign": "",
   "text": "You re mostly worried about your own stuff today, but other people are trying to deal with theirs on your time -- how annoying! You might need to be polite, but try to do your own thing if you can."
 },
 {
   "sign": "",
   "text": "Has something been bothering you? Most likely, there s a lot more going on than meets the eye, so poke around a bit deeper and find the answer -- or at least a new clue. The answer will follow shortly."
 },
 {
   "sign": "",
   "text": "Has something been bothering you? Most likely, there s a lot more going on than meets the eye, so poke around a bit deeper and find the answer -- or at least a new clue. The answer will follow shortly."
 },
 {
   "sign": "",
   "text": "It s a good day to focus on what someone else needs rather than on your own needs. Helping has never been more profitable, if you consider your emotions to be the ultimate form of payback."
 },
 {
   "sign": "",
   "text": "Face it, you don t have boundless energy. Use it wisely or you ll sputter out altogether. Making money should be your number one priority for today and until you re more financially secure."
 },
 {
   "sign": "",
   "text": "When it comes to your new ultra-expensive gym membership, you ve lost all self-control. Nothing but going full speed ahead will keep you motivated. Try to curb your enthusiasm, though, when it comes to spreading the news."
 },
 {
   "sign": "",
   "text": "Your strong sense of self-worth means you don t worry about losing your identity in a romantic relationship. Of course, you can still allow someone special into your life and let them influence you. Let yourself be open to new experiences!"
 },
 {
   "sign": "",
   "text": "Watch out for an interesting stranger with offbeat interests. Ask big, leading questions. You can have a great time getting to know them, and they love showing off their smarts. It s a win/win!"
 },
 {
   "sign": "",
   "text": "Someone you ve been watching surprises you with an extravagant gesture. What does it all mean? If they re trying to sweep you off your feet, they re likely succeeding. Expect fun times in the future!"
 },
 {
   "sign": "",
   "text": "It s the little things that make great love stories. All those big, dramatic moments are more fun on TV shows. When you and your partner are in the moment, unnecessary worries somehow evaporate."
 },
 {
   "sign": "",
   "text": "You re feeling unusually introspective. Your partner is too. If you want, you can talk about it. If not, agree to have some quiet time and be alone together."
 },
 {
   "sign": "",
   "text": "All of those electronic devices can get in the way of communication if you don t make an effort to use your self-editor. Sometimes the best way to get your point across is to save your words for face-to-face interactions."
 },
 {
   "sign": "",
   "text": "A customer or distant work connection could surprise you with an opinion you hadn t considered before. You might find that it s perfectly in tune with your worldview once you absorb it."
 },
 {
   "sign": "",
   "text": "Use that intuition of yours to find the battlefield the fight s raging. You have to deal with the fog of war in a big way over the next few days. There s no way you can sit things out until more information comes in."
 },
 {
   "sign": "",
   "text": "Housekeeping is good for you right now, so get to work closing out old projects and clearing up space for the next new wave of business to come in."
 },
 {
   "sign": "",
   "text": "You re not a punk rocker and you d feel like a poseur if you dressed like one, but that doesn t mean you can t borrow a few elements to give yourself some edge. A few metal studs, zippers as an accent: you re good to go."
 },
 {
   "sign": "",
   "text": "If you go out wearing a great dress without the proper support, an essential part of your look is being neglected. When those undergarments are frayed or the elastic is coming loose, it s time to do some shopping."
 },
 {
   "sign": "",
   "text": "It doesn t seem like it could make much of a difference, but if your workouts have been sluggish, think about getting a cute new tank top or a snazzy pair of running shoes. You ll be more excited about hitting the gym."
 },
 {
   "sign": "",
   "text": "Generate some good traveler s karma at the beginning of the week. Keep your eyes peeled and offer help to someone who needs it. Listen and absorb instead of offering up your opinion. On Wednesday or Thursday, with a little patience, you can find a creative solution to a bump in your plans. Think about an interesting side trip instead of just cooling your heels. Proceed with caution in money matters this weekend. Do a little research before you fork over a significant amount. Sunday s a fabulous day to try something out-there that you can t do at home."
 },
 {
   "sign": "",
   "text": "You plus pretty much anyplace equals a great combination at the beginning of the week, and you re beloved by the people as well. A new friend (or more!) is in the stars, so smile and say hi. Starting Wednesday afternoon and through Friday, your experiences on the road take you to a deeper personal level. The kind of self-discovery you make now is precious indeed. This weekend, you re completely fired up about your trip, and all things travel oriented are favored. Plan your big exploring ventures for these days."
 },
 {
   "sign": "",
   "text": "Watch for an experience or a person who can turn your whole outlook upside-down on Monday in a good way. Conversely, there s someone in a position of authority who can really slow you down on Tuesday or Wednesday. Quash your ego and feign respect if you have to; calling it like you see it won t help matters. Plan all sorts of diverse activity for Thursday, Friday, and Saturday. Exercise your brain and your body, and take in as many new sights and ideas as humanly possible. Sunday s perfect for downtime to relax and absorb it all."
 },
 {
   "sign": "",
   "text": "A big dose of a different country s culture will be stimulating and fun, so investigate something foreign and new. Check out the art, food, or music from another country. You might not understand everything you see, eat, or hear, but so what? A little bit of confusion can be awfully compelling sometimes. You might come across a region of the world you want to explore in person too."
 },
 {
   "sign": "",
   "text": "As exciting or tantalizing as it may seem, other people s drama is going to do nothing but add trouble to your life right now, so steer clear! There is no need to get involved in anyone else s problems even if you think you have a solution. They are different from you, so what worked for you might only make things worse for them. You can express your ideas, but don t offer advice and don t take anyone s side. Stay neutral right now."
 },
 {
   "sign": "",
   "text": "Your dedication to a current project is helping you get a lot accomplished, but devoting too much time to work will leave you without the time you need to make improvements in your love life. A potential sweetie needs to know that you aren t blowing them off, so message or or call them to set up a date for the future. Make sure that they know why you aren t going to be as available as you usually are. Don t make them guess."
 },
 {
   "sign": "",
   "text": "You re not so sure you re heading in the right direction, and today brings the most obvious sign yet. It s a great time to back up and try to figure out what to do next -- it won t be long before you re back on track!"
 },
 {
   "sign": "",
   "text": "You can be pretty open sometimes, but not today! It s one of those times when you just know you re right, and you have a really hard time believing anyone who says otherwise. You ll straighten it all out soon."
 },
 {
   "sign": "",
   "text": "You really want to make progress today -- maybe with some home project or maybe with a crush -- but you re having a hard time moving forward. Don t take any shortcuts; they only set you back."
 },
 {
   "sign": "",
   "text": "It s a good day, whether you re single or involved in a relationship. That s because all the energy you usually reserve for making money is suddenly available for more romantic pursuits. Enjoy."
 },
 {
   "sign": "",
   "text": "It s a perfect day to aim for romance. Your heart and your head are in agreement for once. It doesn t take much hard work on your part, but what you put into it more than pays for itself."
 },
 {
   "sign": "",
   "text": "When it comes to the right way to make money, you re of two minds. Not everybody else involved is as open minded as you are, though. They may respond better if you pretend you re giving criticism rather than suggestions."
 },
 {
   "sign": "",
   "text": "Others might not know it, but underneath your calm, practical surface lies the soul of a hedonist. It s been way too long since you let it out! It could be champagne with strawberries, a long massage, or aromatherapy, whatever it is, now is the time to indulge!"
 },
 {
   "sign": "",
   "text": "You may think you ve got this dating business all sorted out, but now someone comes along to shake things up. You can stick to your old ideas, or you can let this person teach you something. The choice is yours, but why not see what they have to offer?"
 },
 {
   "sign": "",
   "text": "For now, you really don t care what others think about you. You re likely to tell them exactly what you re thinking. It s a really great time for you to set boundaries. You ve got more power than you know!"
 },
 {
   "sign": "",
   "text": "A change of scenery will do you both good, especially if there s been too much staring at the TV and not enough moving around. A bike ride, a long walk, or even a drive out of town will stimulate you."
 },
 {
   "sign": "",
   "text": "Not everything that suits you will suit your partner, and vice versa. Find ways to celebrate your differences and you ll soon discover that you have even more in common where it truly counts."
 },
 {
   "sign": "",
   "text": "Couples  yoga or regular after-dinner walks can cement the bond between you and your partner. Not only that, but your physical self feels strong and resilient as a result. So what are you waiting for?"
 },
 {
   "sign": "",
   "text": "Though you have some nagging big-picture questions, they re not getting in the way of your productivity. Your energy is up for any task right now."
 },
 {
   "sign": "",
   "text": "Life is still good, though you might be looking for opportunities for direct conflict with competitors. You should do well in fair matches, but watch out for folks who decide not to play fair."
 },
 {
   "sign": "",
   "text": "Don t sit on your ideas at this time. You re entering a brief but unusually productive phase, and you can develop new ways of meeting goals for yourself and your peers. Speak up when it s your turn."
 },
 {
   "sign": "",
   "text": "Yes, the color looks bright in the case, but give it a try anyway. With the new formulas available, an eye-popping shade might actually be subtle and radiant on. If you don t like it, all you have to do is wipe it off."
 },
 {
   "sign": "",
   "text": "The right accessories can subtly turn up your style quotient even if the clothes remain the same. Your tried-and-true going-out outfit looks fresh if you add a pair of eye-catching earrings and great shoes."
 },
 {
   "sign": "",
   "text": "Swap out regular pasta and use whole wheat instead and have some oatmeal and tea for breakfast at home rather than getting that muffin and latte on the run. Save yourself empty calories and some money, too."
 },
 {
   "sign": "",
   "text": "Getting creative about your trip pays off big time at the beginning of the week. Be ready to take someone s hearty recommendation for an off-the-beaten-path experience. Wednesday and Thursday are good times to reorganize your stuff in both the material and emotional sense. Lighten your load of luggage both physically and mentally. This weekend, a fresh and flexible perspective means you re ready to move at your own pace through a world that s moving at its own. Let the differences in life here charm you rather than make you wish for the boring old status quo back home."
 },
 {
   "sign": "",
   "text": "A minor setback at the beginning of the week is more than outweighed by both the pleasure and the deeper meaning you re finding on the road. Getting to know yourself better is much more gratifying than plans going perfectly. Thursday and Friday bring opportunities to see things from many different perspectives. Talk to all kinds of people you meet, and listen to their jokes and wisdom. You re a great communicator now, despite any language barriers. This weekend, try something a little daring, something you wouldn t do or taste or see at home. Live it up!"
 },
 {
   "sign": "",
   "text": "Forget your shy side on Monday, as you re all about conversation, debate or even flirtation with the people you re meeting. Travel in general is favored from Tuesday through Thursday. Look for the most foreign experiences possible -- food you ll never get at home, local sporting events, outdoor concerts. Seek the unforgettable and you ll find it. Don t obsess about little things on Friday or Saturday; let  em go and concentrate on bigger-picture fun. Communicating carefully now will help too"
 },
 {
   "sign": "",
   "text": "Communication will be very rewarding and effective today, full of good wishes and a new level of cooperation. People are more interested in what you have to say right now, and they re ready to help you bring your ideas to fruition. Don t let this day end without moving forward on at least one project or goal. If you ve been waiting to do something until the \"right\" time, this is the day to do it!"
 },
 {
   "sign": "",
   "text": "A new person could come into your life whose powerful, magnetic charisma you find captivating! But be careful it doesn t distract you from what you need to get done. Prioritize your responsibilities ahead of building a new connection with this person. Resisting their pull will be easy once you get engrossed in what you have to do. You re ready to share your time and ideas with others, but first you have to fulfill your commitments."
 },
 {
   "sign": "",
   "text": "Just because someone has more experience than you in one area doesn t mean that they know more than you about everything! Remember your strengths and hold your head high. You can participate with the best of them, so jump right in. Take control. Chances are no one is going to mind. In fact, people are eager to hear what you have to say. Your quiet nature has had people talking. They are curious about what kind of leader you will be."
 },
 {
   "sign": "",
   "text": "Love is booming for you in one way or another. If you already have a partner, expect things to get pretty sweet for a while. If not, then maybe you re about to meet someone special."
 },
 {
   "sign": "",
   "text": "You re facing a decision that seems like a big deal, but it s actually just as simple as you versus them. It s perfectly okay to elevate your own needs right now, because your people are adults."
 },
 {
   "sign": "",
   "text": "You can get a ton of stuff out of the way today as long as you don t waste time in trying to figure out whether to take on new projects. Don t! You can revisit after a few days have passed."
 },
 {
   "sign": "",
   "text": "Something has you feeling weird, and it s your past. The only way to avoid feeling sentimental is to keep busy. No lying around, reminiscing. Give yourself five minutes to indulge, then start making money."
 },
 {
   "sign": "",
   "text": "Money issues just refuse to die. You have to deal with them over and over again until you find their particular silver bullet. You re in luck, because you ll find today s the moment you start feeling sentimental or weird."
 },
 {
   "sign": "",
   "text": "You get along well with others, but do you really understand them? Spend the day walking around in their shoes, so to speak. You ll all be able to make more of a profit once you re able to see things from their point of view."
 },
 {
   "sign": "",
   "text": "After a bit of an emotional time, things should be feeling calm once again. Clear your schedule and enjoy a quiet night at home with your favorite TV shows and some take-out. You need to recharge before starting up the search again."
 },
 {
   "sign": "",
   "text": "You re likely reminiscing about a past romance. Even when things don t work out as you hope, you always learn something from the experience. Spend time today thinking about all you ve learned and what you want to do differently from now on."
 },
 {
   "sign": "",
   "text": "Do your homework. If you expect an evening-long discussion of big issues, you should be prepared. Your brain is the sexiest thing about you right now!"
 },
 {
   "sign": "",
   "text": "Sometimes channel surfing is just what you need to decompress. Why not try it in the real world? Talk to your partner about anything and everything that crosses your mind."
 },
 {
   "sign": "",
   "text": "You just know that if you and your partner got this thing off the ground right now, your success would be in the bag. Well, don t rush into anything just because of this sense of urgency. It ll pass before you know it."
 },
 {
   "sign": "",
   "text": "Someone from the past wants back into your life. Remind them that forgiving doesn t necessarily mean forgetting or picking up where you left off. You have better things to do."
 },
 {
   "sign": "",
   "text": "You can t figure out what s going on between you and your peers, but don t panic. Deep-seated issues are to blame. Try to move past them."
 },
 {
   "sign": "",
   "text": "You might just need to perform some routine maintenance, or you might need to forestall a crisis. Regardless, everything you need to do will involve your relationships with customers and co-workers."
 },
 {
   "sign": "",
   "text": "You might need to let go of a cherished perk or project to ensure workplace harmony. It will definitely be worth it, as you ll see in short order. Stubbornness won t pay off."
 },
 {
   "sign": "",
   "text": "A peaceful lunch hour at the stores can be ruined by a pushy salesperson who wants to give you a makeover. Just be firm and say no, thank you. You have a right to browse at your own pace and in peace."
 },
 {
   "sign": "",
   "text": "The best fashion inspiration comes from the streets. Check out sites that feature normal people wearing great outfits and inspired combinations from all over the globe. You ll be filled with fresh style motivation."
 },
 {
   "sign": "",
   "text": "Dressing well is in the details. If you wear a coat with a dramatic shawl collar, don t match it with a big scarf or it ll make you look bulky. Pair it with smooth, layered separates that lie neatly under your outerwear."
 },
 {
   "sign": "",
   "text": "You could bump up against some limitations imposed on your trip at the beginning of the week or even a little self-imposed homesickness. Enjoy each moment for what it is rather than wish for what it could be. By Wednesday and Thursday, this realistic rather than idealistic approach means you re entirely enjoying your travels, and those who meet you are eager to help. Get insider tips for interesting spots. If a major plan gets derailed this weekend, don t rush to fill in the time. The stars say meandering about and smelling the proverbial roses could be even more fun."
 },
 {
   "sign": "",
   "text": "The beginning of the week looks splendid for you as a traveler. Your appreciation of art and music should definitely be fed now, as well as your social side. Mix it up! Money s on your mind on Thursday or Friday. Perhaps you re looking at your trip budget or contemplating purchasing something more than a souvenir. If you re going to splurge in one area, conserve in another. This weekend, your exploration of your physical surroundings is accompanied by a very fruitful and expansive inner journey. Now that s what travel is all about."
 },
 {
   "sign": "",
   "text": "Any interaction on the road could turn intense on Monday in the good or challenging sense. Your positive attitude swings it toward the good. Your beautiful qualities are powered up from Tuesday through Thursday, and you ll want to experience beauty as well. Check out local options for discount museum passes or last-minute concert tickets. Share your reflections about your trip with a new friend on Friday or Saturday, and email someone dear about what you re experiencing (and send a copy to yourself to read later). Expect a disruption on Sunday, but you can handle it with grace."
 },
 {
   "sign": "",
   "text": "Stepping outside your comfort zone is by definition uncomfortable, but isn t it usually ultimately rewarding too? You re in a strong risk-taking phase and you are brave. This combination means that right now you re in a prime position to make a huge leap in your life. Whether it s changing your job, moving to a new city, or starting a new relationship, you are ready to explore living your life in a new way. Talk to those who have done it before and get some tips."
 },
 {
   "sign": "",
   "text": "You could encounter someone who seems like a textbook example of a jerk, but try to be open-minded about them. Judging a book by its cover has never been your style, so don t start now. Extenuating circumstances are at work here. Maybe they re intimidated by you. Maybe they re acting out because they re worried or just have a headache. You just don t know enough to know why they re acting the way they are. Give them a chance and give them time."
 },
 {
   "sign": "",
   "text": "Just like it only takes a minor snag in the carpet to trip you up, it will only take a minor detail to derail your plans today. But instead of turning a paranoid eye on everything you see, just be aware that little slipups have a chance of occurring and try to carry on as normal. You can t make every little detail perfect, so don t waste your time trying. Just stay alert and be ready with a backup plan should your original plan go awry. You are spry and smart enough to bob and weave."
 },
 {
   "sign": "",
   "text": "You can feel a huge surge of confident energy so if you ve been unsure of something or not quite able to exert yourself in some regard, now is the time to make it happen. You won t regret it!"
 },
 {
   "sign": "",
   "text": "You re glowing with personal energy, and people are probably staring. It s a good thing, though it gives them the opportunity to check you out for real and see whether they want to get closer."
 },
 {
   "sign": "",
   "text": "You pride yourself on your resistance to peer pressure, but every now and then someone finds out how to push your buttons. You might find yourself doing almost anything later tonight!"
 },
 {
   "sign": "",
   "text": "You don t have the emotional reserves necessary to deal with conflict. Only make plans with those you get along well with. The others just aren t worth you spending your cash."
 },
 {
   "sign": "",
   "text": "You ll be happier if you let it all go. No amount of planning can get a handle on your day. It s chaos from the moment you get up until the moment you give up trying to control it all."
 },
 {
   "sign": "",
   "text": "Problems at home affect everything, from your health to your ability to make money. That s why having a good weekend is so crucial. It s almost a business priority. Good job."
 },
 {
   "sign": "",
   "text": "An ex could show up once again and want to start back up with you. They may seem sincere, so ask yourself if you re ready to take them back. If you say yes, remember that this time the outcome is entirely up to you."
 },
 {
   "sign": "",
   "text": "A new crush might have you flying so high you feel like you re in space! Savor the feeling while remembering to keep at least partly grounded. You need to have a soft place to land when you re ready to come back down."
 },
 {
   "sign": "",
   "text": "You need to add a little structure to your life and set realistic goals. Dream big, though. If you want to write that novel, travel around the world, or redo your house, that can help guide your love life."
 },
 {
   "sign": "",
   "text": "A million things are happening simultaneously, and you and your partner are at the center of the whirlwind. Remember, the eye of the storm is by far the calmest place to be. You ve got it under control."
 },
 {
   "sign": "",
   "text": "A ho-hum feeling has taken hold of your daily routine. It s time to shake things up. Sing a song to your partner out of the blue. Take an impromptu trip even if it s only to the backyard."
 },
 {
   "sign": "",
   "text": "Right now you and your partner are more interested in staying in one place. The tried-and-true isn t just fine and dandy: it makes you two very happy. It s time for comfort food, favorite movies, and cozy slippers."
 },
 {
   "sign": "",
   "text": "Those displays in the stores are tempting and they re supposed to be. Exercise your will power  try on anything and everything that catches your fancy, but only buy the very, very best that fits within your budget"
 },
 {
   "sign": "",
   "text": "Have a big event you re shopping for? Explore vintage shops, flea markets and online boutiques. It s so much more interesting than going to a giant department store and grabbing something off the rack."
 },
 {
   "sign": "",
   "text": "Taking your physique into account helps you make the best style choices. If you re petite, a T-strap shoe will visually shorten your legs. If you re tall, a boldly printed dress might come across as excessive."
 },
 {
   "sign": "",
   "text": "Your usual determination is coupled with diplomacy at the beginning of the week, meaning doors that are shut to other travelers are open to you. Traveling duos or groups get along well now. This may not be quite the case on Wednesday and Thursday, when your ideas about how this trip should be are in conflict with someone else s. How about choosing a third way, something neither of you is considering? Unusual options are favored by the stars, so find one. The weekend can find your every hope for this journey being surpassed, including you finding the possibility of a little romance."
 },
 {
   "sign": "",
   "text": "You may not feel entirely outgoing at the beginning of the week. It s a good time for some quieter, more contemplative activities. A day at a museum or some time on the water is calming and inspiring. From Wednesday through Friday, your confidence is back up and you re raring to go. You ve got energy to spare, so pack your days full of sights and physical activity. Make time to talk with locals and fellow travelers too. Everyone s drawn to you now. If a deal seems too good to be true this weekend, it probably is. Trust your gut feeling."
 },
 {
   "sign": "",
   "text": "If you re feeling iffy health-wise on Monday, don t wait to take action; finding a doctor now is better than losing a couple days. Tuesday through Thursday find you eager for excitement; a competitive sport or a daring foray into a different culture should do the trick. Smile but be firm during transactions on Friday and Saturday. Do the math yourself and count your change before leaving the cashier. Foreign things are favored on Sunday, so try on some new ideas inspired by your locale, taste the specialties and engage the people. Your experience will be much the richer."
 },
 {
   "sign": "",
   "text": "Everyone is singing your praises right now, and it s a sweet sound! This extra level of attention you re receiving might not last too long, so you d better take advantage of it while you can. Gobble up the limelight, and be sure to savor all the adulation. You know you rock, but it s awfully nice to have someone else notice it too!"
 },
 {
   "sign": "",
   "text": "The smallest details of the day could be like blinking neon signs. That s how powerful your observational skills will be. This means it s a great day for negotiating. You ll be able to read the other person like a book. You ll have the upper hand today, there is no denying that! You might have to explain what is going on to the confused folks around you."
 },
 {
   "sign": "",
   "text": "You have a very generous spirit, and you need to extend that generosity toward how you constructively criticize people. Whether it s your partner, a friend, or a co-worker, it could up to you to help them. Don t be too harsh about it. Just say what needs to be said and give them a very generous benefit of the doubt. They need you to be honest with them, but they also need you to be careful with them."
 },
 {
   "sign": "",
   "text": "Find a good way to write down your dreams tonight, or even scribble down stray thoughts as they come to you. Your subconscious is a lot less  sub  than usual, so it s totally worth it!"
 },
 {
   "sign": "",
   "text": "Let your imagination go berserk today and see what kinds of insanity you come up with. You might not be in the most social of moods, but you can still dream up all sorts of awesome schemes!"
 },
 {
   "sign": "",
   "text": "It s an almost perfect day for you so enjoy it and don t feel obligated to get serious unless you really want to. It s the perfect time to set out in a new direction and explore new territory."
 },
 {
   "sign": "",
   "text": "Penny pinching is a habit that s hard to break. You ve gotten it down to a science and you re not about to stop any time soon. There s plenty to do today that s free or cheap, so enjoy."
 },
 {
   "sign": "",
   "text": "You ve been so focused on money that you ve forgotten the important things in life. Music or art brings it all back into perspective today. You ll end your day realigned with what really matters."
 },
 {
   "sign": "",
   "text": "It s all about numbers, and about people, of course. The more people you connect with, the more likely you are to make a deal. Don t lose sight of the importance of the basic humanity of the whole equation."
 },
 {
   "sign": "",
   "text": "It s time to clear away some mundane business so you re free to play later. Spend extra time tackling any long-neglected cleaning or organizing and then reward yourself with fun."
 },
 {
   "sign": "",
   "text": "After the past few weeks, you re likely craving a bit more stability. For now, you value substance over style. Someone who can act as an anchor for you has the most appeal."
 },
 {
   "sign": "",
   "text": "Try not to appear overly available for the time being. Hold off and just let things develop. If you reply instantly to that e-mail or phone call, you send the wrong message. Take your time and dream up the best response. They re not going anywhere!"
 },
 {
   "sign": "",
   "text": "An impulsive decision lands you two in a different spot from where you started. You didn t know it would happen, but the truth is you think you re going to like it here! Going with your gut gets good results now."
 },
 {
   "sign": "",
   "text": "You two were feeling a touch sleepy, but now you re wide awake. Now that you ve sorted some things out, it s time to celebrate. Take it nice and easy. That way you ll enjoy yourselves all the more."
 },
 {
   "sign": "",
   "text": "Sensitivity isn t going to get you where you want to go with your partner right now. Sometimes you need a tap on the shoulder. Other times you need to drop an anvil. Save the subtlety for later."
 },
 {
   "sign": "",
   "text": "Take it easy with beauty procedures today, especially ones you re performing yourself. You don t want to tweeze too much off your eyebrows or use wax that s too hot on your legs. Better safe than sorry!"
 },
 {
   "sign": "",
   "text": "Don t get hypnotized by the purchasing high. After you buy one or two pieces, it s easy to get hooked by the adrenaline and to keep purchasing. Always check in and reevaluate before you head over to the register."
 },
 {
   "sign": "",
   "text": "Ask your stylist what shampoo she actually uses. Turns out that those fancy brands aren t necessarily used by people in the know. When you look at the ingredients, you ll see the formulas are similar."
 },
 {
   "sign": "",
   "text": "A straightforward approach wins you bargains at the beginning of the week. Try something as simple as just asking for a special rate or the lowest fare. Your good humor makes people want to help you out. The exchange of ideas rather than money is favored on Wednesday and Thursday. Let others buy their souvenirs while you re collecting new concepts and hilarious stories. Beware of leaving your bank card in an ATM or your hotel key on a hiking trail this weekend. Material things tend to get away from you now. Be extra careful or have a traveling partner handle the money and carry the essentials."
 },
 {
   "sign": "",
   "text": "Your freedom-loving nature is right at home on the road, especially at the beginning of the week. Spend a little time with a guidebook or other preparations. It ll make deciding what to do (and when to wing it) easier. Watch for a shift in your mood after Wednesday. The journey you re taking through your inner landscape could distract you from the actual one. Allow time for contemplation and time to be alone. This weekend, though, your jovial side s back, and you re an ambassador of personal goodwill. Making the world a better place the way you are is great for your karma."
 },
 {
   "sign": "",
   "text": "Monday s great fun, and even more so if you play or watch a game . Watch your diet and your wallet simultaneously on Tuesday and Wednesday; a quick breakfast pastry at a local cafe or grabbing lunch to go is fun, energizing and light on the belly and the budget. There s a ton to see and do from Thursday through Saturday, but attend carefully to your interactions with others while you re at it. Ask questions and show your enthusiasm, and you ll be rewarded. Leave Sunday wide open for whatever strikes your fancy."
 },
 {
   "sign": "",
   "text": "Letting go of some of your negative energy is easier to do when you get your heart pumping! Go for a long jog or just do some jumping jacks in your kitchen while you fix dinner. As long as you can fit some kind of exercise into your day, you will help yourself get over an old grudge, forgive someone who wronged you, or shake loose a bad feeling about someone. Focusing on making your life better lets you be more positive overall."
 },
 {
   "sign": "",
   "text": "Things aren t nearly as dire as they appear you need to make sure you have your friends with you, though. They ve got what you need, even if you don t realize it until they say something."
 },
 {
   "sign": "",
   "text": "There s plenty of details in today s big drama, and you need to absorb them all before you can make sense of it. Take your time, even if your best friend is pushing hard for you to do something!"
 },
 {
   "sign": "",
   "text": "You can t believe what you re hearing, but it s true. Convince at least one person you re right, even in the face of too much outside pressure. Sometimes the right folks prevail!"
 },
 {
   "sign": "",
   "text": "The best thing about having a good partner is not thinking about impressing them. But you manage to do it without even trying. Enjoy the recognition you didn t even notice working for."
 },
 {
   "sign": "",
   "text": "You don t have to have a great day. A plain old positive one will do the trick. But with your energy and enthusiasm, you can t help but take everything over the top. Go for it."
 },
 {
   "sign": "",
   "text": "You re tempted to give up the high road for the newest scheme to come down the pike. Almost but not quite. Stick to your guns. If you need incentive, visualize your future as a snake oil salesman. It s not an attractive sight."
 },
 {
   "sign": "",
   "text": "When it comes to saying how you feel, your energy is helping right now. It s time to let your secret crush in on what s going on! Let them know you re interested in getting to know them quite a bit better."
 },
 {
   "sign": "",
   "text": "The path to love might seem long, and sometimes you just want to make something happen already! Try to remember that perseverance is essential. Keep on playing, and everything should fall into place when you least expect it."
 },
 {
   "sign": "",
   "text": "You need to strike a balance between perfection and reality. You could be too caught up in your ideals, so try to broaden your criteria. Keep an open mind so you don t miss out on a great match."
 },
 {
   "sign": "",
   "text": "That mad urge to go to Tahiti? Why not indulge it just this once? Okay, you don t have to really pick up and go, but at least you two can start researching plane tickets and places to stay. What s the harm in that?"
 },
 {
   "sign": "",
   "text": "You ve got an itch and you want to scratch it. The trouble is you re not exactly sure where the itch is or what will remedy it. Just tell your partner to bear with your restless spirit right now and all will be well."
 },
 {
   "sign": "",
   "text": "You re rock-solid and dependable. Your partner loves knowing they can count on you. You re pretty fond of it yourself. Just make sure you don t get too attached to that view of yourself. You re multifaceted."
 },
 {
   "sign": "",
   "text": "Old clothes can become new ones with a few nips and tucks. Turns pants into shorts, long skirts into minis and trim sleeves on shirts. Now your former favorites have a new sense of life. Your wallet will thank you."
 },
 {
   "sign": "",
   "text": "Smoother, firmer skin can be yours, but not right away. Find a good microdermabrasian home kit, eat better and sleep more. The results will be amazing but not instantaneous and they ll look more natural for it."
 },
 {
   "sign": "",
   "text": "Work with what you have instead of longing after what you think you lack. Accentuating the positive automatically eliminates the negative. There s so much to celebrate about the way you look. Get started now."
 },
 {
   "sign": "",
   "text": "You re at risk of overworking yourself, and today s a great day to take off if you have too much comp or vacation time accrued. Keep an eye on your stress meter."
 },
 {
   "sign": "",
   "text": "Make sure your thoughts are clear. Get rid of any distractions. In fact, close yourself off if that s what it takes. Wear ear plugs if you have to."
 },
 {
   "sign": "",
   "text": "You feel a new source of strength and a new desire for openness in communication. Let people know exactly how you feel about the current situation."
 },
 {
   "sign": "",
   "text": "All your practical, patient planning makes for a smooth path at the beginning of the week. Don t be surprised if other travelers are impressed with your prep work and general savvy. Share your wealth of knowledge and simultaneously improve your travel karma. Be ready to be flexible on Wednesday and Thursday. If something falls through, quash your fatalistic response and look at it as an opportunity for spontaneous fun. Art and music are favored this weekend. See if there s a venue with low-cost last-minute tickets or check out free gallery shows."
 },
 {
   "sign": "",
   "text": "Take in some local culture at the beginning of the week, and go beyond the museum or the opera. Get real-deal specialties at small, family-run restaurants, seek out alternative art in cafes, or make new friends playing a sport. From Wednesday through Friday, make a plan so you can fit in everything you want to do. You re a traveler with a purpose, and your practicality means you can accomplish it. Don t speed through things this weekend, however. Lingering over a beverage or conversation proves more memorable than tearing around seeing each and every thing."
 },
 {
   "sign": "",
   "text": "Don t fret if you feel out of your element on the road on Monday a little time helps immensely with adjusting. By Tuesday, you re traveling with savvy and fitting right in. Plan some outdoor activities, as you re likely to be drawn to nature now. By Friday and Saturday, you re streamlining your luggage by collecting experiences and ideas rather than souvenirs. Watch for someone overly chatty, however; the running commentary could get old fast. Sunday finds you itching to move on -- take a day trip, switch your lodgings or just get on the next train."
 },
 {
   "sign": "",
   "text": "Today might not be the most exciting day you ve ever experienced, but who says you always need excitement? Besides, being bored isn t the end of the world! When you have fewer things to keep your mind occupied, it finds it own ideas to contemplate, whether consciously or not. So if you re left with nothing to do today, just soak it in. You will get comfortable sitting quietly by yourself. It s a good break, so enjoy it."
 },
 {
   "sign": "",
   "text": "Better than anyone else right now, you understand the energy that a connection between two people can create. It s all about pairs. Groups can be fun, but right now they could feel more strange than stimulating. What you really crave and what you really need is to spend time with just one other person. It can be your partner, a sibling, a friend, or even a stranger. It could be in person or by video chat. But spending time as part of a pair today could be very rewarding and revealing."
 },
 {
   "sign": "",
   "text": "There is a fine line between having a healthy ego and having an inflated ego. You know it, but someone else may not! If you re feeling charitable, you can save them from themselves by stepping in and preventing them from saying something they ll regret later. But if you re not feeling especially compassionate, feel free to let them dig their own hole. But be careful. Their demise does not necessarily mean that you ll be stepping into their shoes."
 },
 {
   "sign": "",
   "text": "You just aren t yourself today until you start helping others, from roommates with hair crises to folks on the street who just need a bit of your change. It s all good from that point on!"
 },
 {
   "sign": "",
   "text": "Someone says the wrong thing in front of you early-ish today and leaves you feeling really weird. There s an upside, though a hottie who overhears suddenly learns all they need to know about you!"
 },
 {
   "sign": "",
   "text": "You are even more interested in the people and groups you spend your time with, and you might find you re all getting along even better than usual. Now is the best time for you to say something!"
 },
 {
   "sign": "",
   "text": "Subliminal stuff can come to the surface if it wants to, because you have all the time in the world to deal with it for a change. Spend the day on the couch if you must but get to work tomorrow."
 },
 {
   "sign": "",
   "text": "Don t waste your time trying to be disciplined. The day just doesn t ask it of you. Flail away to your heart s content if that suits you or, better yet, do nothing at all."
 },
 {
   "sign": "",
   "text": "There s no moping around wishing for money. The weekend gave you enough of an energy boost to jump start your week and even your season. You re ready for Fall and all the change and excitement that comes with it."
 },
 {
   "sign": "",
   "text": "Ring up an older relative and ask them to tell you what it was like to be single when they were younger. Learning how your favorite aunt and uncle met is fun, and it might also be inspiring."
 },
 {
   "sign": "",
   "text": "The chemistry between you and that new person is almost scary! With attraction like this, it s just a matter of time before sparks start to fly, so you ought to clear your calendar."
 },
 {
   "sign": "",
   "text": "A change in perspective opens up many new opportunities. You could find romantic adventures where you found nothing but boredom the other day. Don t give up when a door closes. Another one will open soon."
 },
 {
   "sign": "",
   "text": "Do you want the right results or just the quickest ones? Both you and your partner are feeling particularly impatient. Be aware of it and you won t do anything rash. Patience isn t just a virtue: it s a skill."
 },
 {
   "sign": "",
   "text": "Both of you are fired up. It s a great time to get a new project off the ground, start talking about the future, or just race each other around the block. From small to large activities, you two are having fun."
 },
 {
   "sign": "",
   "text": "Just when you were chafing against your daily routine, you and your significant other rediscover what s particularly sweet about your regularly scheduled programming. You re content."
 },
 {
   "sign": "",
   "text": "It s a weird day, but you re exactly the right person to deal with the strangeness. You ll feel like a superhero, and you might be treated like one when it s over."
 },
 {
   "sign": "",
   "text": "The urge to make the world a better place strikes again. This time, your action can benefit the human race, including that portion of it that works for and with you."
 },
 {
   "sign": "",
   "text": "An odd discovery sets you apart even further from the mainstream, but in a relatively good way. If your supervisors value your eccentricity for the energy it brings, you ll move forward quickly."
 },
 {
   "sign": "",
   "text": "You ve used that lipstick practically every day and now it s practically gone. What to do? Scrape out the last bits and throw it in an empty container with some lip balm. Now you have a lip gloss and saved cash."
 },
 {
   "sign": "",
   "text": "Did your salon charge you for a service you didn t have? Speak up the minute you notice it. Even if they can t give you a refund, they can give you a credit for the next time you come back for a visit."
 },
 {
   "sign": "",
   "text": "Some days are perfect for adding a purple streak to your hair. Better yet, try out the look with some clip-on extensions that way you ll have all of the fun with none of the long-term commitment or upkeep."
 },
 {
   "sign": "",
   "text": "A freewheeling approach at the beginning of the week finds you spinning your wheels. Get your hands on a good guidebook and create a plan. A little structure means you ll get way more out of it all. Return to your open-ended, spontaneous ways on Wednesday and Thursday, when the world tosses great stuff right in your path and you hardly have time to get to anything on your itinerary. Let your love of people shine. Interactions you have now are wonderful ones. This weekend, exercise some serious prudence in financial matters. A picnic of fresh, local stuff is a fabulous start."
 },
 {
   "sign": "",
   "text": "Smile and say a hearty hello in the native tongue at the beginning of the week. The openness you bring can open the whole world up to you, and your genuine friendliness is the best gift you have to give. You might feel torn between socializing and independent exploration on Thursday or Friday. The answer is to find a balance. You re energized by others, but you also have inner traveling to do now through some deep feelings. The weekend s more about pure fun and a gorgeous expansion of horizons. You can also make wonderful connections now."
 },
 {
   "sign": "",
   "text": "The most powerful motivator right now isn t your ambition: it s your emotions. Trust them and follow them wherever they take you today. Good or bad, they are genuine and honest. If you want to pour your heart out to someone who you re seriously crushing on, do it. Whatever the result, it will make you stronger and remind you how powerful you are. Being direct in your communication might be hard, but it will save you time and help you grow."
 },
 {
   "sign": "",
   "text": "You could get a lot of positive reinforcement in the form of beautiful words about how wonderful, smart, or desirable you are. Naturally, this will leave you feeling pretty good about yourself! Build on that good feeling by taking a few more bold risks and challenges in your life. You need to start believing that you can excel in the most demanding situations. After all, everyone else believes you can. It s perfectly fine to prove them right."
 },
 {
   "sign": "",
   "text": "People are curious about you, and their questions could keep you talking nonstop. They want to know what you re doing now, what you re doing next, and what you think about what they re doing. It could be exhausting! But you don t have to be too specific about what you re doing in your life right now, especially if you feel it will be an invasion of your privacy. Besides, the details could be a bit tedious. Save them for another time."
 },
 {
   "sign": "",
   "text": "It s a really good day to try signing on with something but only once you re totally sure it s for you. It may be a new love or a new job, but once you re in, you re in for quite a while."
 },
 {
   "sign": "",
   "text": "You re too busy with your rich inner life to worry much about the so-called real world, but today you need to come back to earth for a bit to deal with a legal or business issue that won t leave you alone."
 },
 {
   "sign": "",
   "text": "Listen up people need your attention! It s one of those days when you can get by with a simple smile and nod as long as you re willing to let everyone say what they need to say."
 },
 {
   "sign": "",
   "text": "As much as your finances need a new direction, you re helping yourself by not planning a new strategy. It s not a good time to do so, wait a few more days and you will be good."
 },
 {
   "sign": "",
   "text": "It s an easy kind of day, with no one in charge. That s just the way you and your friends like it. Being leaderless isn t the same as being rudderless. Enjoy the lazy pace of life s current."
 },
 {
   "sign": "",
   "text": "Being realistic is more valuable than being idealistic right now, but that doesn t mean you shouldn t dream. As long as you don t allow yourself any pie in the sky, they can be quite productive."
 },
 {
   "sign": "",
   "text": "Spend a little time at home cooking something to share. If you don t have a dining companion in mind, that hottie who just moved into your building is likely to enjoy your hospitality."
 },
 {
   "sign": "",
   "text": "There are so many layers to dig through to get to the heart of your latest crush. As long as you re having fun, keep it up. Fortunately for you, all the extra effort is sure to be worth it."
 },
 {
   "sign": "",
   "text": "You re irresistible when you re a little unsure of yourself. Someone hot watches with delight as you bumble through a conversation or something bigger. Don t get too self-conscious you re doing great!"
 },
 {
   "sign": "",
   "text": "You ve got an itch, but darned if you know how to scratch it. The fact is you want a little change of pace, but you re not quite sure whether to speed things up or slow them down. No decisions have to be made right now."
 },
 {
   "sign": "",
   "text": "You and your partner each have an area of expertise in this relationship. Maybe you change the oil in the car while they deal with the budget. There s nothing wrong with finding a comfortable groove."
 },
 {
   "sign": "",
   "text": "Everyone should be lined up on the same side and agreeable to your aesthetic vision. Creative work will be surprisingly simple for you and your people."
 },
 {
   "sign": "",
   "text": "There s no way to know exactly when you ve received everything you need, so don t worry about it. Certain facts are hidden from view, and you might need to proceed without them."
 },
 {
   "sign": "",
   "text": "Impress your people with your newfound gift for blarney. It won t last forever, but you ll be able to mesmerize just about anyone by picking the words they want to hear."
 },
 {
   "sign": "",
   "text": "If you have nothing to wear, go on and clean out your closet. Once you put all the items you never use in a donation pile, you might discover that you actually have all you need without adding to your credit card bills."
 },
 {
   "sign": "",
   "text": "The bargain mani-pedi is good for regular maintenance, but every now and then you want and need a luxury experience. So call up the best salon you know and book the most pampering, high end nail session they have."
 },
 {
   "sign": "",
   "text": "The lines to pick up your dry cleaning are far too long, so tackle another errand that s lower on your to-do list. It s a good time to pick up prescriptions or to get a few items on your shopping list."
 }
]